____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
dense_1 (Dense)                  (None, 100)           1800        dense_input_1[0][0]              
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 100)           0           dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 100)           0           activation_1[0][0]               
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 100)           10100       dropout_1[0][0]                  
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 100)           0           dense_2[0][0]                    
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 100)           0           activation_2[0][0]               
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 134)           13534       dropout_2[0][0]                  
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 134)           0           dense_3[0][0]                    
====================================================================================================
Total params: 25434
____________________________________________________________________________________________________
